#)for loop-ის საშუალებით ტერმინალში გამოიტანეთ 30-ჯერ "GOA IS THE BEST"

#for i in range(30):
   #print(" GOA IS THE BEST ")

#for i in range(30):
   #print("GOA ORIENTED ACADEMY")


#2)for loop-ის საშუალებით ტერმინალში 5-დან 150-ის ჩათვლით ნომრები

#for i in range(5,150 + 1):
   #print(i)

#for i in range(1,1000 + 1):
   #print(i)

#3)for loop-ის საშუალებით ტერმინალში გამოიტანეთ 2-დან 50-ის ჩათვლით ნომრები ოღონდ ნაბიჯი იყოს 4

#for i in range(2,50+1, 4):
  #print(i)

#4) for loop-ის საშუალებით ტერმინალში გამოიტანეთ  10-ჯერ ყოველი ( i ელემენტი და გვერდით მიუწერეთ, "GOA")

#for i in range(10+1):
    #print(str(i)+ "GOA")


#5) დაწერეთ პროგრამა for loop-ის გამოყენებით, რომელიც გამოგვიტანს ჯერ ლუწს და შემდეგ კენტს.


#for i in range(1,10+1):
    #print("even")
    #print("odd")

#6) შექმენით პროგრამა სადაც გამოიყენებთ While loop - ს. 
#თქვენი დავალება იქნება ის, რომ მომხამრებელს შემოატანინოთ რიცხვი და თქვენ უნდა გამოიცნოთ ეს რიცხვი, ხოლო ყოველ არ გამოცნობილ რიცხვზე ისევ თავიდან უნდა შეგეკითხოთ და შეიყვანოთ რიცხვი.
num = int(input("enter number:"))

while True:
   print ("temo")










